import ListBlock from "./components/ListBlock/listBlock"
import styles from "./page.module.css"

export default function Ranking(){
    return(
        <div className={styles.wrapper}>
            <ListBlock 
                rank_num={1}
                point_count={9999}
                file_name="user_id.test"
                name="PR TIMES"
                text="株式会社PR TIMESは、東京都港区赤坂に本社を置く日本のPR会社で、2005年12月26日に設立されました。 主な事業内容は、プレスリリース配信サービス「PR TIMES」の運営であり、企業や官公庁、自治体などが作成したプレスリリースを広く配信しています。 また、カスタマーサポートツール「Tayori」やタスク・プロジェクト管理ツール「Jooto」など、広報・PR支援に関連するサービスも展開しています。 同社は「行動者発の情報が、人の心を揺さぶる時代へ」というミッションを掲げ、情報インフラとしての役割を果たすことを目指しています。 2024年7月には、利用企業数が10万社を突破しました。本社所在地は、〒107-0052 東京都港区赤坂1-11-44 赤坂インターシティ8Fです。 "/>
            <ListBlock 
                rank_num={2}
                point_count={7000}
                file_name="user_id.test"
                name="PR TIMES"
                text="株式会社PR TIMESは、東京都港区赤坂に本社を置く日本のPR会社で、2005年12月26日に設立されました。 主な事業内容は、プレスリリース配信サービス「PR TIMES」の運営であり、企業や官公庁、自治体などが作成したプレスリリースを広く配信しています。 また、カスタマーサポートツール「Tayori」やタスク・プロジェクト管理ツール「Jooto」など、広報・PR支援に関連するサービスも展開しています。 同社は「行動者発の情報が、人の心を揺さぶる時代へ」というミッションを掲げ、情報インフラとしての役割を果たすことを目指しています。 2024年7月には、利用企業数が10万社を突破しました。本社所在地は、〒107-0052 東京都港区赤坂1-11-44 赤坂インターシティ8Fです。 "/>
            <ListBlock 
                rank_num={3}
                point_count={5000}
                file_name="user_id.test"
                name="PR TIMES"
                text="株式会社PR TIMESは、東京都港区赤坂に本社を置く日本のPR会社で、2005年12月26日に設立されました。 主な事業内容は、プレスリリース配信サービス「PR TIMES」の運営であり、企業や官公庁、自治体などが作成したプレスリリースを広く配信しています。 また、カスタマーサポートツール「Tayori」やタスク・プロジェクト管理ツール「Jooto」など、広報・PR支援に関連するサービスも展開しています。 同社は「行動者発の情報が、人の心を揺さぶる時代へ」というミッションを掲げ、情報インフラとしての役割を果たすことを目指しています。 2024年7月には、利用企業数が10万社を突破しました。本社所在地は、〒107-0052 東京都港区赤坂1-11-44 赤坂インターシティ8Fです。 "/>
        </div>
    )
}